---
kind: type
id: T:Autodesk.Revit.DB.ElementBinding
source: html/15ebf308-364c-2bef-e91c-dd6552e5ccbe.htm
---
# Autodesk.Revit.DB.ElementBinding

A base class for all types of binding that attach to an element.

## Syntax (C#)
```csharp
public abstract class ElementBinding : Binding
```

## Remarks
This base class provides methods that are common to all types of binding that
work with elements.